{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "input_dtype": "float32", "name": "convolution2d_67", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "bias": true, "batch_input_shape": [null, 32, 32, 6], "activation": "linear", "nb_filter": 30, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_85", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_85", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_85", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_68", "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 50, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_86", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_86", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_86", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_69", "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 60, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_87", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_87", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_87", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_70", "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 80, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_88", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_88", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_88", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_71", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 100, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_89", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_89", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_89", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_72", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 110, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_90", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_90", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_90", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_73", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_91", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_91", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_91", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_74", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_92", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_92", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_92", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_75", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_93", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_93", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_93", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_76", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_94", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_94", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_94", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_77", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_95", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_95", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_95", "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_25", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 130, "input_dim": 520, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_96", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_96", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_96", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_26", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 120, "input_dim": 130, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_97", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_97", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_97", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_27", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 120, "input_dim": 120, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_98", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_98", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_98", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_28", "W_constraint": null, "activation": "softmax", "b_constraint": null, "output_dim": 43, "input_dim": 120, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}]}