{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "input_dtype": "float32", "name": "convolution2d_12", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "bias": true, "batch_input_shape": [null, 32, 32, 6], "activation": "linear", "nb_filter": 30, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_15", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_15", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_13", "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 50, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_16", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_16", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_14", "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 60, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_17", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_17", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_15", "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 80, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_18", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_18", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_16", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 100, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_19", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_19", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_17", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 110, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_20", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_20", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_18", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_21", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_21", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_19", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_22", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_22", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_20", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_23", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_23", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_21", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_24", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_24", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_22", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 130, "trainable": true, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_25", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_25", "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_5", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 130, "input_dim": 520, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_26", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_26", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_6", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 120, "input_dim": 130, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_27", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_27", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_7", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 120, "input_dim": 120, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batchnormalization_28", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_28", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_8", "W_constraint": null, "activation": "softmax", "b_constraint": null, "output_dim": 43, "input_dim": 120, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}}}]}